Revit 2027 API
BuiltInFailures.ElementFailures.SplitElementHasTagsWithoutLeaders Property
 The split element has one or more Tags without Leaders enabled and needs to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SplitElementHasTagsWithoutLeaders { get; }
Public Shared ReadOnly Property SplitElementHasTagsWithoutLeaders As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SplitElementHasTagsWithoutLeaders {
	FailureDefinitionId^ get ();
}
static member SplitElementHasTagsWithoutLeaders : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElementFailures Class
Autodesk.Revit.DB Namespace